app/controllers/pets_controller.rb

  def index
    @pets = Pet.all
---
SELECT "pets".* FROM "pets"

  def create
    @pet = Pet.new(pet_params)

    if @pet.save
---
INSERT INTO "pets" ("animal", "breed", "age", "gender", "size", "pic", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"  [["animal", ""], ["breed", ""], ["age", ""], ["gender", ""], ["size", ""], ["pic", ""], ["location", ""], ["created_at", "2020-05-10 19:16:37.036685"], ["updated_at", "2020-05-10 19:16:37.036685"]]

  def update
    if @pet.update(pet_params)
---
UPDATE "pets" SET "animal" = $1, "breed" = $2, "age" = $3, "gender" = $4, "size" = $5, "pic" = $6, "location" = $7, "phone" = $8, "email" = $9, "updated_at" = $10 WHERE "pets"."id" = $11  [["animal", "Cat"], ["breed", ""], ["age", ""], ["gender", ""], ["size", ""], ["pic", ""], ["location", ""], ["phone", ""], ["email", ""], ["updated_at", "2020-05-11 19:08:37.633465"], ["id", 1]]

  def destroy
    @pet.destroy
---
DELETE FROM "pets" WHERE "pets"."id" = $1  [["id", 1]]

    def set_pet
      @pet = Pet.find(params[:id])
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]